reddit_on_rails/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "child comment"], ["author_id", 1], ["post_id", 1], ["parent_comment_id", 3], ["created_at", "2018-09-19 00:14:13.229585"], ["updated_at", "2018-09-19 00:14:13.229585"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save