reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save
---
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 4], ["sub_id", 1], ["created_at", "2018-09-18 22:35:12.586742"], ["updated_at", "2018-09-18 22:35:12.586742"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "lorem"], ["url", "ipsum.dolor"], ["content", "sit amet"], ["sub_id", 1], ["author_id", 2], ["created_at", "2018-09-18 21:39:16.429157"], ["updated_at", "2018-09-18 21:39:16.429157"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "cat.com"], ["content", "cats"], ["updated_at", "2018-09-18 23:48:40.363263"], ["id", 1]]

  def require_author
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]