reddit_on_rails/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 4]]
---
  <label>Subs
    <% Sub.all.each do |subreddit| %>
      <input type="checkbox" name="post[sub_ids][]" value="<%=subreddit.id%>" <%= "checked" if @post.sub_ids.include?(subreddit.id) %>><%= subreddit.title %>