reddit_on_rails/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 1]]
---

<% if @post.comments.where(parent_comment_id: nil).length > 0 %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
<ul>
  <% @post.comments.where(parent_comment_id: nil).each do |comment| %>
  <li> <a href="<%= comment_url(comment) %>"><%= comment.content %></a> - <%= comment.author.username %>
    <% if comment.child_comments.length > 0 %>