reddit_on_rails/app/views/subs/show.html.erb

SELECT "subs".* FROM "subs"
---
  <label>Subs
    <% Sub.all.each do |subreddit| %>