reddit_on_rails/app/models/user.rb

  def self.find_by_cred(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "chris"], ["LIMIT", 1]]

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "PQ5XN-U96xTbW27pM9MFUw"], ["updated_at", "2018-09-18 21:17:22.603699"], ["id", 1]]